## Task 1

You should import the necessary libraries. You will use `numpy` and `pandas` libraries.


> Don't forget to import `numpy`, and `pandas` in short form.

In [1]:
import numpy as np
import pandas as pd

## Task 2

Create a `DataFrame` from the given dictionary `data`.

In [5]:
data = {
    "Name": ["John", "Emily", "Ryan"],
    "Age": [16, 28, 22],
    "City": ["New York", "Los Angeles", "Chicago"],
}

# write your code here
df = pd.DataFrame(data)

## Task 3

In this task you should complete the following steps:

### Task 3.1
Display all data for `Age` column for the DataFrame you created in the previous task.

In [6]:
# Write your code here
df["Age"]

0    16
1    28
2    22
Name: Age, dtype: int64

### Task 3.2

Add `Salary` column to the `DataFrame` with the values `[50000, 60000, 45000]`.

In [4]:
# Write your code here
df["Salary"] = [50000, 60000, 45000]
df

    Name  Age         City  Salary
0   John   16     New York   50000
1  Emily   28  Los Angeles   60000
2   Ryan   22      Chicago   45000

### Task 3.3

Filter the `DataFrame` to show only the rows with the `Age` greater than 18.

In [20]:
# Write your code here
filtered_df = df[df["Age"] > 18]
filtered_df

    Name  Age         City  Birth year
1  Emily   28  Los Angeles        1996
2   Ryan   22      Chicago        2002

## Task 4

In this task you should complete the following steps:

### Task 4.1

Add new calculated field `Birth year`;

In [19]:
# Write your code here
current_year = 2024
df["Birth year"] = current_year - df["Age"]
df

    Name  Age         City  Birth year
0   John   16     New York        2008
1  Emily   28  Los Angeles        1996
2   Ryan   22      Chicago        2002

### Task 4.2

Add new calculated field `Average age`.

In [21]:
# Write your code here
df["Average age"] = df["Age"].mean()
df

    Name  Age         City  Birth year  Average age
0   John   16     New York        2008         22.0
1  Emily   28  Los Angeles        1996         22.0
2   Ryan   22      Chicago        2002         22.0

### Task 4.3

Calculate absolute difference between `Age` and `Average age`.

In [23]:
# Write your code here
df["Absolute difference"] = (df["Age"] - df["Average age"]).abs()
df

    Name  Age         City  Birth year  Average age  Absolute difference
0   John   16     New York        2008         22.0                  6.0
1  Emily   28  Los Angeles        1996         22.0                  6.0
2   Ryan   22      Chicago        2002         22.0                  0.0

## Task 5

Complete the following tasks described below.

### Task 5.1

You have two dictionaries `data1` and `data2`. Create two `DataFrame` objects from these dictionaries. Then, `concatenate`, and `merge` these two `DataFrame` objects into one `DataFrame` object, and see the difference.

In [30]:
# Data
data1 = {'Name': ['John', 'Emily', 'Ryan'],
         'Age': [25, 28, 22]}
data2 = {'Name': ['Emily', 'Ryan', 'Mike'],
         'City': ['Los Angeles', 'Chicago', 'Houston']}

# create DataFrame objects
df_1 = pd.DataFrame(data1)
df_2 = pd.DataFrame(data2)

In [43]:
# merge
merged_df = pd.merge(df_1, df_2, on="Name", how="outer")
merged_df

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0  Los Angeles
2   Ryan  22.0      Chicago
3   Mike   NaN      Houston

In [42]:
# concatenate
concatenated_df = pd.concat([df_1, df_2])
concatenated_df

    Name   Age         City
0   John  25.0          NaN
1  Emily  28.0          NaN
2   Ryan  22.0          NaN
0  Emily   NaN  Los Angeles
1   Ryan   NaN      Chicago
2   Mike   NaN      Houston

### Task 5.2

You have two `Series` objects `s1` and `s2`. Make default mathematical operations on these two `Series` objects. Such as `+`, `-`, `*`, `/`, `**`, `//`, `%`. Also, filter `s1` and print only even numbers, and `s2` only with odd numbers.

In [3]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([6, 7, 8, 9, 10])

In [4]:
# use + operator here
addition = s1 + s2

In [76]:
# use - operator here
subtraction = s1 - s2

In [71]:
# use * operator here
multiplication = s1 * s2

In [77]:
# use / operator here
division = s1 / s2

In [78]:
# use ** operator here
exponentiation = s1 ** s2

In [80]:
# use // operator here
floor_division = s1 // s2

In [79]:
# use % operator here
modulo = s1 % s2

In [81]:
# filter s1 here
even_numbers = s1[s1 % 2 == 0]

In [5]:
# filter s2 here
odd_numbers = s1[s1 % 2 != 0]

### Task 5.3

You have a `Serias` object `s`. Make the following operations on this `Series` object:

* make all words in uppercase without loops;
* get length of each word without loops.

In [65]:
s = pd.Series(["numpy", "pandas", "matplotlib"])

In [67]:
# make all words in uppercase
s_upper = s.str.upper()

In [68]:
# get length of each word
s_len = s.str.len()

## Task 6 Optional

You have a large dataset consisting of a series of numbers. Your task is to calculate the moving average of the series using a window of `5` elements. The moving average is the average of a set of consecutive values in the series, where the window `slides` through the series to compute the average at each position. The goal is to calculate the moving average efficiently and accurately. Also, compare time performance of Python and Pandas solutions.

> Please, note: If you get `nan` while calculating the moving average, you should remove it from the result. Pandas solution should take 1-2 lines of code.

### Python Solution

In the Python solution, a large dataset is generated using random numbers. The moving average is computed by iterating over the dataset using a loop. At each position, a window of 5 elements is created, and the average is calculated by summing the values in the window and dividing by 5.

In [11]:
import random

def unknown_signature():
    # Generate a large dataset
    data = [random.randint(1, 100) for _ in range(10000000)]

    # Calculate the moving average with a window of 5
    moving_averages = []
    for i in range(4, len(data)):
        window = data[i - 4 : i + 1]
        average = sum(window) / 5
        moving_averages.append(average)
    return moving_averages[:10]

%time unknown_signature()

CPU times: total: 7.94 s
Wall time: 8.13 s

[36.0, 47.8, 40.4, 40.2, 45.6, 42.0, 26.6, 42.2, 51.2, 38.8]

### Solution using Pandas and Numpy

In [14]:
# write your code here
data_set = pd.Series(np.random.randint(0, 100, size=(10_000_000)).astype(np.int8))
moving_averages = data_set.rolling(window=5).mean().dropna().head(10).tolist()

%time moving_averages

CPU times: total: 0 ns
Wall time: 0 ns

[50.2, 48.2, 47.4, 44.8, 50.6, 32.0, 33.4, 44.4, 55.0, 50.6]